books = {
    "Магистр": [
        "Лермонтов",
        "Достоевский",
        "Пушкин",
        "Тютчев"
    ],
    "ДомКниги": [
        "Толстой",
        "Грибоедов",
        "Чехов",
        "Пушкин"
    ],
    "БукМаркет": [
        "Пушкин",
        "Достоевский",
        "Маяковский"
    ],
    "Галерея": [
        "Чехов", 
        "Тютчев",
        "Пушкин"
    ]
}
# оформленный словарь
res = []
for shop in books:
    if "Маяковский" in books.get(shop):
        res.append(shop)
print(f"Маяковского можно приобрести в {', '.join(res)}")