def RectPS(x1,y1,x2,y2):
    return 2*(abs(x1-x2)+abs(y1-y2)), abs(x1-x2)*abs(y1-y2) # abs нужны если координаты будут отрицательные

for i in range(3): # 3 раза находить периметр и площадь прямоугольников
    x1 = int(input("Введите координату x1: "))
    x2 = int(input("Введите координату x2: "))
    y1 = int(input("Введите координату y1: "))
    y2 = int(input("Введите координату y2: "))

    P, S = RectPS(x1, x2, y1, y2)
    print(f"Прямоугольник: {i+1}", f"Периметр: {P}", f"Площадь: {S}", sep="\n", end="\n")